//Задача про площадь решения которой нет на кодфорс
#include <iostream>
#include <cmath>
using namespace std;
int main() {
	int n, m, a, ans;
	cin >> n >> m >> a;
	ans = ((n * m) / (a * a));
	cout << ans;
	return 0;
}